diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НовыйЭлемент = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Начало периода действия";     
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_КонецДействияДоговора", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Конец периода действия";  
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Сумма абонентской платы";   
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа работы";    
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;   
	Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;   
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	КонецЕсли;

	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда        
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;   
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры    

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры






#КонецОбласти
